-- Лабораторна робота №1
-- студента групи КН-32
-- Каліти Вячеслава
-- Варіант №13

-- Мета: Ознайомитись з основними типами мови. Ознайомитись зi структурою та
-- функцiями Glasgow Haskell Compiller. Набути навичок роботи з iнтерпретатором
-- ghci та визначення найпростiших функцiй.

--Завдання 1. Наведiть приклади виразiв вказаного типу. Кожен список має мiстити кiлька елементiв. Перегляньте тип прикладiв, як їх визначає ghci. Прокоментуйте.
--([Bool],[[Double],(Char,Integer)])

--(([True,False],[[5.0, 2/6], ('a',3)])
--([1>0, 2<3], [([7/3,4+5/6], ('s', 8)),([9/5,4.6], ('f', 4))])

--Завдання 2. Визначте два варiанти вказаних далi функцiй. Перший варiант – з одним аргументом-кортежем, другий – без використання кортежiв чи спискiв
--Функцiя приймає три рядки (String) i повертає лексикографiчно найбiльше з них--

--a)
f1 :: (String, String, String) -> String
f1 (s1, s2, s3) = if s1 >= s2 && s1>=s3 then s1
    else if s2 >= s1 && s2>= s3 then s2
        else s3

--б)
f2 :: String->String->String->String 
f2 s1 s2 s3 
    | s1>=s2 && s1>=s3 = s1
    | s2>=s1 && s2>=s3 = s2 
    | otherwise = s3 

-- Висновок: В результаті виконання лабораторної роботи, ми ознайомилися з основними типами мови Haskell,
-- набули навичок роботи з інтерпритатором ghci та навчились визначати найпростіші функції.